In [1]:
#df.groupby('Computer')
#df.groupby('Computer').mean()
#df.groupby('Computer').sum()
#df.groupby('Computer').mean().loc[]
#df.groupby

import numpy as np

In [2]:
import pandas as pd

In [3]:
data = {'Company': ['Goog', 'Goog', 'MS', 'MS', 'Meta', 'Meta'],
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [4]:
data

{'Company': ['Goog', 'Goog', 'MS', 'MS', 'Meta', 'Meta'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2      MS      Amy    340
3      MS  Vanessa    124
4    Meta     Carl    243
5    Meta    Sarah    350

In [8]:
bycomp = df.groupby('Company')

In [9]:
bycomp.Company

In [10]:
bycomp.mean()

         Sales
Company
Goog     160.0
MS       232.0
Meta     296.5

In [11]:
bycomp.sum()

         Sales
Company
Goog       320
MS         464
Meta       593

In [13]:
bycomp.apply(lambda x: x*2)

           Person  Sales
0          SamSam    400
1  CharlieCharlie    240
2          AmyAmy    680
3  VanessaVanessa    248
4        CarlCarl    486
5      SarahSarah    700

In [14]:
bycomp.std()

              Sales
Company
Goog      56.568542
MS       152.735065
Meta      75.660426

In [15]:
bycomp.var()

           Sales
Company
Goog      3200.0
MS       23328.0
Meta      5724.5

In [17]:
bycomp.mean().loc['Meta']

Sales    296.5
Name: Meta, dtype: float64

In [18]:
df.groupby('Company').sum().loc['Meta']

Sales    593
Name: Meta, dtype: int64

In [19]:
df.groupby('Company').mean().loc['Meta']

Sales    296.5
Name: Meta, dtype: float64

In [21]:
df.groupby('Company').count()

         Person  Sales
Company
Goog          2      2
MS            2      2
Meta          2      2

In [22]:
df.groupby('Company').count()['Person']

Company
Goog    2
MS      2
Meta    2
Name: Person, dtype: int64

In [23]:
df.groupby('Company').min()

          Person  Sales
Company
Goog     Charlie    120
MS           Amy    124
Meta        Carl    243

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MS        2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Meta      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [25]:
df.transpose()

            0        1    2        3     4      5
Company  Goog     Goog   MS       MS  Meta   Meta
Person    Sam  Charlie  Amy  Vanessa  Carl  Sarah
Sales     200      120  340      124   243    350